In [23]:
import mysql.connector
cnx=mysql.connector.connect(host='localhost',port=3306,user='root',password='',database='lab_assignment1')
cursor=cnx.cursor(buffered=True)
cursor.execute('SHOW TABLES')
for x in cursor:
    print(x)

('dept_total_salary',)
('faculty',)
('facultyy',)
('instructor',)
('salary_total',)
('teacher',)
('teaches3',)
('teaches33',)

In [3]:
cursor.execute("CREATE FUNCTION calllc(jan int, feb int,mar int) RETURNS int(9) BEGIN DECLARE total int(9); SET total = jan+feb+mar; RETURN total; END;")

In [4]:
query = """set @x=calllc(%s,%s,%s)"""
a=int(input())
b=int(input())
c=int(input())
tuple1=(a,b,c)
cursor.execute(query, tuple1)
cursor.execute("select @x;")
r=cursor.fetchall()
print(r)

[(38000,)]

In [7]:
cursor.execute("ALTER TABLE instructor ADD age int(10) DEFAULT 42")

In [8]:
cursor.execute("select * from instructor")
myresult = cursor.fetchall()
for x in myresult:
    print(x)

(10101, 'Srinivasan', 'Comp. Sci.', 65000.0, 42)
(32343, 'El Said', 'History', 60000.0, 42)
(33456, 'Gold', 'Physics', 87000.0, 42)
(45565, 'Katz', 'Comp. Sci.', 75000.0, 42)
(58583, 'Califieri', 'History', 62000.0, 42)
(76543, 'Singh', 'Finance', 80000.0, 42)
(76766, 'Crick', 'Biology', 72000.0, 42)
(83821, 'Brandt', 'Comp. Sci.', 92000.0, 42)
(98345, 'Kim', 'Elec. Eng.', 80000.0, 42)
(10101, 'Srinivasan', 'Comp. Sci.', 65000.0, 42)
(12121, 'Wu', 'Finance', 90000.0, 42)
(15151, 'Mozart', 'Music', 40000.0, 42)
(1234, 'amndar', 'maths', 90000.0, 42)
(10211, 'Smith', 'Biology', 66000.0, 42)

In [12]:
mySql_insert_query = """INSERT INTO instructor (Id, name, depname, salary , Age) 
                           VALUES (%s, %s, %s, %s,%s) """
records_to_insert = [('10101','Srinivasan','Comp. Sci.',65000, 34), 
                     ('12121','Wu','Finance',90000, 38),
                     ('22222','Einstein','Physics',95000, 55),
                    ('15151','Mozart','Music',40000, 45)]


cursor.executemany(mySql_insert_query, records_to_insert)
print(cursor.rowcount, "Record inserted successfully into instructor table")

4 Record inserted successfully into instructor table

In [13]:
#declaring and defining function
cursor.execute("set global log_bin_trust_function_creators = 1")
cursor.execute("create function isSabbatical (age int(10)) returns int begin declare result TINYINT; set result = age > 40; return result; end")

In [16]:
# Print the name of all instructor who are eligible  for sabbatical
cursor.execute("select Distinct(name) from instructor where isSabbatical(age ) = 1")
myresult = cursor.fetchall()
print("Instructors who are eligible  for sabbatical")
for x in myresult:
    print(x)

Instructors who are eligible  for sabbatical
('Srinivasan',)
('El Said',)
('Gold',)
('Katz',)
('Califieri',)
('Singh',)
('Crick',)
('Brandt',)
('Kim',)
('Wu',)
('Mozart',)
('amndar',)
('Smith',)
('Einstein',)

In [21]:
cursor.execute("ALTER TABLE instructor ADD COLUMN exemptions double")

In [22]:
cursor.execute("ALTER TABLE instructor ADD COLUMN gross_salary double")